#  <u> 1st step : Load

Open the final merge table of the 'normalization part '

In [1]:
# we import the useful librairies 

import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import functools
import os
import plotly.express as px
from scipy.stats import shapiro
import ipywidgets as widgets
from ipywidgets import Layout
from ipywidgets import interact, interact_manual


# we open and read the merge table of all indicators
bronze_dataset = pd.read_csv ('bronze_dataset_with_outliers.csv')
bronze_dataset = bronze_dataset.drop(bronze_dataset.columns[0], axis = 1)
bronze_dataset

     Code  Year           Indicator  Real value  Lower value  Upper value
0     AFG  2005              Deaths  118653.000   93160.5000  127150.5000
1     AFG  2010              Deaths  101658.000   93160.5000  127150.5000
2     AFG  2005      LifeExpectancy      58.400      57.1500      62.1500
3     AFG  2010      LifeExpectancy      60.900      57.1500      62.1500
4     AFG  2005    GenderInequality       0.748       0.7455       0.7555
...   ...   ...                 ...         ...          ...          ...
3517  ZWE  1990  tertiary_education       1.830      -0.8800       2.6400
3518  ZWE  1995  tertiary_education       1.320      -0.8800       2.6400
3519  ZWE  2000  tertiary_education       0.530      -0.8800       2.6400
3520  ZWE  2005  tertiary_education       0.440      -0.8800       2.6400
3521  ZWE  2010  tertiary_education       0.380      -0.8800       2.6400

[3522 rows x 6 columns]


# <u>STEP : Remove outliers 

We need to find outliers and remove them 
To do that, we take our renamed final table, and with loc , we keep only specific datas
    
Indeed the ' ~ ' means 'not' and the folowing condition is'values out of range' it means when 'the real value is not between the lower value and the upper value '
    
So at the end we will just have the values not out of range, so we will remove outliers with this command

In [2]:
without_outliers=bronze_dataset.loc[~((bronze_dataset['Real value']<bronze_dataset['Lower value']) | (bronze_dataset['Real value']>bronze_dataset['Upper value']))]
without_outliers

     Code  Year           Indicator  Real value  Lower value  Upper value
0     AFG  2005              Deaths  118653.000   93160.5000  127150.5000
1     AFG  2010              Deaths  101658.000   93160.5000  127150.5000
2     AFG  2005      LifeExpectancy      58.400      57.1500      62.1500
3     AFG  2010      LifeExpectancy      60.900      57.1500      62.1500
4     AFG  2005    GenderInequality       0.748       0.7455       0.7555
...   ...   ...                 ...         ...          ...          ...
3517  ZWE  1990  tertiary_education       1.830      -0.8800       2.6400
3518  ZWE  1995  tertiary_education       1.320      -0.8800       2.6400
3519  ZWE  2000  tertiary_education       0.530      -0.8800       2.6400
3520  ZWE  2005  tertiary_education       0.440      -0.8800       2.6400
3521  ZWE  2010  tertiary_education       0.380      -0.8800       2.6400

[3335 rows x 6 columns]

Then we delete the upper and lower values colums to reduce our final table

In [3]:
table_clean =without_outliers.drop(['Lower value','Upper value'],axis=1)
table_clean

     Code  Year           Indicator  Real value
0     AFG  2005              Deaths  118653.000
1     AFG  2010              Deaths  101658.000
2     AFG  2005      LifeExpectancy      58.400
3     AFG  2010      LifeExpectancy      60.900
4     AFG  2005    GenderInequality       0.748
...   ...   ...                 ...         ...
3517  ZWE  1990  tertiary_education       1.830
3518  ZWE  1995  tertiary_education       1.320
3519  ZWE  2000  tertiary_education       0.530
3520  ZWE  2005  tertiary_education       0.440
3521  ZWE  2010  tertiary_education       0.380

[3335 rows x 4 columns]

# <u>  STEP : Silver

In [4]:
silver_dataset1=table_clean.set_index(["Code", "Year"]).pivot(columns="Indicator", values="Real value").reset_index()
silver_dataset=silver_dataset1.rename(columns={0: 'index'})
silver_dataset

Indicator,Code,Year,Deaths,Fertility,GDP,GenderInequality,LifeExpectancy,tertiary_education
0,AFG,2005,118653.0,6.9047,3.451279e+09,0.748,58.4,3.61
1,AFG,2010,101658.0,6.0987,1.031396e+10,0.753,60.9,3.65
2,ALB,2000,1449.0,2.2310,2.400530e+09,0.319,75.4,3.51
3,ALB,2005,815.0,1.8026,4.487185e+09,0.306,76.6,2.35
4,ALB,2010,473.0,1.6564,7.718874e+09,0.246,77.9,0.93
...,...,...,...,...,...,...,...,...
582,ZWE,1990,NaN,NaN,4.946844e+09,0.605,59.4,1.83
583,ZWE,1995,35883.0,4.1539,4.506185e+09,0.594,50.5,1.32
584,ZWE,2000,35389.0,3.9740,4.421600e+09,NaN,44.7,0.53
585,ZWE,2005,36797.0,NaN,NaN,0.595,44.8,0.44
586,ZWE,2010,38616.0,4.0248,NaN,0.592,50.7,0.38

Then we convert this new table into a csv document

In [5]:
silver_dataset.to_csv('SilverDataset.csv')